Revit 2024 API
BuiltInFailures.RebarFailures.CannotSolveRebarWithDelayedConstraints Property
 There are rebar handles with invalid selected targets to constrain. The bar preview corresponds to latest valid constraints.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotSolveRebarWithDelayedConstraints { get; }
Visual Basic
Public Shared ReadOnly Property CannotSolveRebarWithDelayedConstraints As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotSolveRebarWithDelayedConstraints {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace